# Task061 - Работа со строками в Си 3️⃣

В языке C строки представляют собой массивы символов (`char[]`), оканчивающиеся нулевым символом \0. Это означает, что длина строки вычисляется до первого \0.

Объявление строк:
```c
char str1[20];           // пустой массив на 20 символов
char str2[] = "Hello";   // строка с инициализацией, размер = длина + 1
const char *str3 = "World";    // указатель на литерал строки
```
## Ввод строк

| Функция       | Формат / Пример                     | Читает пробелы? | Безопасна? | Особенности |
|---------------|------------------------------------|----------------|------------|-------------|
| `scanf`       | `scanf("%s", str);`                | ❌              | ⚠️ частично | Читает до пробела, нужно ограничивать длину: `%99s` |
| `fgets`       | `fgets(str, sizeof(str), stdin);`  | ✅              | ✅          | Читает до конца строки или лимита. Включает `\n`. |
| `gets`        | `gets(str);`                        | ✅              | ❌          | Опасно! Нет ограничения длины, удалена из C11 |
| `getchar`     | `while ((ch = getchar()) != '\n')` | ✅              | ✅          | Чтение символов по одному, нужно самостоятельно добавлять `\0` |
| `getline` (POSIX) | `getline(&line, &len, stdin);`  | ✅              | ✅          | Динамическая память, возвращает количество символов, включая `\n`. Не стандарт C. |

## Вывод строк

| Функция        | Формат / Пример                     | Добавляет перевод строки? | Особенности |
|----------------|------------------------------------|--------------------------|-------------|
| `printf`       | `printf("%s", str);`               | ❌                        | Универсальная, можно выводить форматированные строки, числа, символы. |
| `puts`         | `puts(str);`                        | ✅                        | Выводит строку + автоматически добавляет `\n` в конце. |
| `putchar`      | `putchar('A');`                     | ❌                        | Выводит один символ за раз, удобно для циклов или поэтапного формирования вывода. |
| `fprintf`      | `fprintf(stdout, "%s", str);`       | ❌                        | Похож на `printf`, но позволяет выводить в файлы или потоки. |
| `fputs`        | `fputs(str, stdout);`               | ❌                        | Похож на `puts`, но не добавляет `\n`, можно выводить в файлы. |


# Передача строки в функцию

Обратите внимание на то, что строки передаются в функцию через указатель. Т.е. sizeof(arr) вернет размер указателя, а не расмер массива. 

```c
void check_addr(char* ptr, char arr[]){
    printf("ptr:\t%s\n", ptr);
    printf("arr:\t%s\n", arr);

    printf("sizeof:\t%ld\n", sizeof(arr));
}
```

## Задание

Напишите программу, которая считывает и выводит на экран любое предложение