# Task075 — atoi 🔍

## В чем проблема

Практически каждая программа так или иначе работает со строками и числами. И очень часто есть необходимость переводить значения из строкового значения в целочисленное для выполнения дальнейших опреаций над числом. Вам ведь не понравиться, если при 2+2 вы получите 22, не так ли? 😏

## Описание функции

Функция определена в `stdlib.h`

Ее прототип:
```c
int atoi(const char *str)
```

Функция `atoi()` конвертирует строку, на которую указывает параметр str, в величину типа int. Строка должна содержать корректную запись целого числа. В противном случае возвращается 0.

Число может завершаться любым символом, который не может входить в состав строкового представления целого числа. Сюда относятся пробелы, знаки пунктуации и другие знаки, не яв­ляющиеся цифрами. Таким образом, вызов функции atoi() для числа 123.23 возвратит целое зна­чение, а часть 0.23 будет опущена.

## Пример использования

```c
#include <stdio.h>
#include <stdlib.h> 

int main()
{
    char str_amount[] = "20";
    int amount = atoi(str_amount);

    amount += 22;
    printf("Answer to all questions: %d", amount);

    return 0;
}
```

Результат в консоли:
```
Answer to all questions: 42
```

----

## Задание

Напишите программу подсчета стоимости билета в музей. Стоимость зависит от возраста поситителя и вычисляется следующим образом:
- Базовая стоимость билета - 100 рублей
- Если возраст поситителя до 6 лет, то проход бесплатный
- Если от 6 до 18 лет, то проход стоит половину цены билета
- Если возраст больше 18 лет, то оплачивается полная стоимость билета

Программа должна получать возраст поситителоя на вход stdin и выдавать результат подсчета прохода в stdout.
Не забудьте проверку на отрицательный возраст. В данном случае должна возвращаться строка о некоректно введеных значениях.
