# Task063 - strcmp

## В чем проблема

Практически каждая программа так или иначе работает со строками. Часто возникает необходимость сравнивать строки, чтобы проверить равенство, сортировать данные, искать совпадения или проверять пользовательский ввод. 

## Описание функции

Функция определена в string.h

Ее прототип:
```c
int strcmp(const char *str1, const char *str2);
```
Функция strcmp() сравнивает строки str1 и str2 построчно по символам:

- Если строки одинаковы — возвращается 0.
- Если первый символ, который отличается, в str1 меньше, чем в str2, возвращается отрицательное число.
- Если первый символ, который отличается, в str1 больше, чем в str2, возвращается положительное число.

Пример:
```c
strcmp("apple", "apple") → 0
strcmp("apple", "banana") → < 0
strcmp("orange", "apple") → > 0
```
Пример использования
```c
#include <stdio.h>
#include <string.h>

int main()
{
    char str1[] = "hello";
    char str2[] = "world";

    int result = strcmp(str1, str2);

    if (result == 0)
        printf("Strings are equal\n");
    else if (result < 0)
        printf("str1 is less than str2\n");
    else
        printf("str1 is greater than str2\n");

    return 0;
}
```
Результат в консоли:
```c
str1 is less than str2
```
## Задание 1

Напишите программу, которая проверяет равенство двух введённых пользователем строк.

## Задание 2

Реализуйте своб версию функции strcmp
