# Task064 - strcat 3️⃣

## В чем проблема

Практически каждая программа так или иначе работает со строками, и часто возникает необходимость объединять две строки в одну. Например, формировать полное имя пользователя, складывать части пути к файлу или составлять сообщения для вывода.

## Описание функции

Функция определена в string.h

Ее прототип:
```c
char *strcat(char *dest, const char *src);
```
Функция strcat() добавляет строку src в конец строки dest. Строка dest должна быть достаточно большой, чтобы вместить результат. Функция возвращает указатель на строку dest. После выполнения dest содержит исходную строку плюс содержимое src.

Пример:
```c
char dest[20] = "Hello ";
char *src = "world!";
strcat(dest, src);
// dest теперь "Hello world!"
```
Пример использования
```c
#include <stdio.h>
#include <string.h>

int main()
{
    char greeting[50] = "Hello, ";
    char name[] = "Alice";

    strcat(greeting, name);

    printf("%s\n", greeting);

    return 0;
}
```
Результат в консоли:
```c
Hello, Alice
```

## Задание 1
Напишите программу, которая объединяет две введённые пользователем строки и выводит результат.

## Задание 2
Реализуйте функции для объединения двух строк. Необходимо реализовать функцию конкатенации, которая создает новую строку, функцию добавления к существующей строке, а также функцию для вычисления длины результирующей строки.

