# Task065 - strstr 3️⃣

## В чем проблема

Очень часто в программах нужно проверять, встречается ли определённая последовательность символов внутри другой строки. Например, вы хотите проверить, содержится ли слово "error" в лог-файле или слово "hello" в пользовательском вводе.

## Описание функции

Функция определена в `string.h`

Ее прототип:
```c
char *strstr(const char *str, const char *substr);
```
Функция strstr() ищет первое вхождение строки substr в строку str. Если подстрока найдена — возвращается указатель на начало подстроки внутри str. Если подстрока не найдена — возвращается NULL. Пустая подстрока "" всегда считается найденной и возвращает str.

Таким образом, strstr("hello world", "world") вернёт указатель на символ 'w' в строке "hello world".

## Пример использования
```c
#include <stdio.h>
#include <string.h>

int main()
{
    char text[] = "Hello world!";
    char *pos = strstr(text, "world");

    if (pos != NULL)
        printf("Found at index: %ld\n", pos - text);
    else
        printf("Substring not found\n");

    return 0;
}
```


## Задание 1
Напишите программу, которая проверяет, есть ли в введённой пользователем строке слово "hello".

## Задание 2
Напишите свою реализацию функции strstr() без использования стандартной библиотеки.

